#### AddVertices Method

---

|  |
| --- |
| VertexStreamPosition Class   See Also |

Inserts multiple  VertexStreamPosition  instances into the stream and associated buffer.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public void AddVertices( 	IList<VertexPosition> vertices ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AddVertices ( _ 	vertices As IList(Of VertexPosition) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AddVertices( 	IList<VertexPosition^>^ vertices ) ``` |

#### Parameters

vertices
:   Type:  System.Collections.Generic IList   VertexPosition
     The vertices to be inserted.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space. |

# See Also

VertexStreamPosition Class

Autodesk.Revit.DB.DirectContext3D Namespace